УчетВУправляющихДляГит1/src/DataProcessors/Панель1СМаркировка/Панель1СМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Панель1СМаркировка</name>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ</name>
  <resources>
    <name>ТекущееУведомлениеОбОтгрузке</name>
    <type>
      <types>DocumentRef.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПодтвержденныхКиЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбОтгрузкеГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ/СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ПоступлениеТоваров</name>
    <type>
      <types>DefinedType.ДокументПоступленияМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоступленийТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПоступления</name>
    <type>
      <types>EnumRef.СтатусыПоступленийГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>КПередачеПодтверждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПодтвержденныхКиЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УведомлениеОПоступленииМаркированныхТоваровГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияГИСМ</name>
  <resources>
    <name>ТекущееУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОбИмпортеМаркированныхТоваровГИСМ</types>
      <types>DocumentRef.УведомлениеОСписанииКиЗГИСМ</types>
      <types>DocumentRef.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ДальнейшиеДействияПоВзаимодействиюГИСМ/ДальнейшиеДействияПоВзаимодействиюГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюГИСМ</name>
  <enumValues>
    <name>ЗакройтеЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеПолучение</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Аннулируйте</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПолучениеКвитанцииОФиксации</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеФормированиеСчетаНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПодтверждениеПолучения</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУтверждениеФНС</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ИсправьтеНекорректныеРеквизиты</name>
  </enumValues>
  <enumValues>
    <name>ПолучитеСчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОплатитеСчет</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУведомлениеОВыпускеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеРегистрациюКлиентаВГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗакрытияУведомления</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ/УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбОтгрузкеГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>DefinedType.НомерДокументаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборотаТовара</name>
    <type>
      <types>EnumRef.ВидОборотаТовараГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNКонтрагента</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентНеЗарегистрированВГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>DefinedType.КодТаможенногоОрганаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДекларации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерДекларации</name>
    <type>
      <types>DefinedType.РегистрационныйНомерДекларацииГИСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Подтверждено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтверждения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОСписанииКиЗГИСМ/УведомлениеОСписанииКиЗГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОСписанииКиЗГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОСписанииКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>Индивидуализирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаСписания</name>
      <type>
        <types>EnumRef.ПричиныСписанияКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаВыпускКиЗ</name>
      <type>
        <types>DocumentRef.ЗаявкаНаВыпускКиЗГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОВвозеИзЕАЭСГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОбИмпортеМаркированныхТоваровГИСМ/УведомлениеОбИмпортеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбИмпортеМаркированныхТоваровГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбИмпортеГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКиЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКиЗ</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидМеха</name>
      <type>
        <types>CatalogRef.ВидыМехаГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/DataProcessors/Панель1СМаркировка/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Организация.Видимость = ИнтеграцияГИСМ.ИспользоватьНесколькоОрганизаций();
	//ГИСМБП
	// Исключено управление настройками
	Элементы.ГруппаНастройки.Видимость = Ложь;
	//Исключена недоступная функциональность
	Элементы.Ответственный.Видимость = Ложь;
	//Конец ГИСМБП
	
	ВосстановитьНастройкиФормы();
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненОбменГИСМ"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусГИСМФормахВДокументах)) Тогда
		
		ОбновитьСпискиДокументов();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ИнтеграцияГИСМКлиент.ВыполнитьОбмен();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛичныйКабинет(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://furs.mark.crpt.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыНоменклатуры(Команда)
	
	ИнтеграцияГИСМКлиентПереопределяемый.ОткрытьФормуСпискаВидыНоменклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуру(Команда)
	
	ИнтеграцияГИСМКлиентПереопределяемый.ОткрытьФормуСпискаНоменклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодыТНВЭД(Команда)
	
	ИнтеграцияГИСМКлиентПереопределяемый.ОткрытьФормуСпискаКлассификатораТНВЭД(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыМеха(Команда)
	
	ОткрытьФорму("Справочник.ВидыМехаГИСМ.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаМаркировки(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрирования1СМаркировка.Форма.Настройки1СМаркировка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЭлектроннойПодписиИШифрования(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиФормы()

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Панель1СМаркировка", "Организация", Организация);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Панель1СМаркировка", "Ответственный", Ответственный);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()

	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Панель1СМаркировка", "Организация", Организация);
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Панель1СМаркировка", "Ответственный", Ответственный);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументов()
	
	МассивЗапросов = Новый Массив();
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ) Тогда
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбОтгрузке");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбОтгрузкеОформите");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбОтгрузкеОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбОтгрузкеОжидайте");
	КонецЕсли;
	
	ДоступенОтчетОРозничныхПродажах = Ложь;
	ИнтеграцияГИСМПереопределяемый.ДоступенОтчетОРозничныхПродажах(ДоступенОтчетОРозничныхПродажах);
	Если ДоступенОтчетОРозничныхПродажах Тогда
		МассивЗапросов.Добавить("ТекстЗапросаОтчетыОРозничныхПродажах");
		МассивЗапросов.Добавить("ТекстЗапросаОтчетыОРозничныхПродажахОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаОтчетыОРозничныхПродажахОжидайте");
	КонецЕсли;
	
	ДоступенВозвратТоваровОтРозничногоКлиента = Ложь;
	ИнтеграцияГИСМПереопределяемый.ДоступенВозвратТоваровОтРозничногоКлиента(ДоступенВозвратТоваровОтРозничногоКлиента);
	Если ДоступенВозвратТоваровОтРозничногоКлиента Тогда
		МассивЗапросов.Добавить("ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов");
		МассивЗапросов.Добавить("ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте");
	КонецЕсли;
	
	//ГИСМБП
	// Исключена обработка документов:
	// - МаркировкаТоваровГИСМ
	// - ПеремаркировкаТоваровГИСМ
	//Конец ГИСМБП
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ) Тогда
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОСписанииКиЗГИСМ");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОСписанииКиЗГИСМОформите");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОСписанииКиЗГИСМОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОСписанииКиЗГИСМОжидайте");
	КонецЕсли;
	
	//ГИСМБП
	// Исключена обработка документов:
	// - ЗаявкаНаВыпускКиЗГИСМ
	//Конец ГИСМБП
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ) Тогда
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОПоступлении");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОПоступленииОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОПоступленииОжидайте");
	КонецЕсли;
		
	Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ) Тогда
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОВвозеИзЕАЭС");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОВвозеИзЕАЭСОформите");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОВвозеИзЕАЭСОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОВвозеИзЕАЭСОжидайте");
	КонецЕсли;
		
	Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ) Тогда
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбИмпорте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбИмпортеОформите");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбИмпортеОтработайте");
		МассивЗапросов.Добавить("ТекстЗапросаУведомленияОбИмпортеОжидайте");
	КонецЕсли;
	
	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "";
		
	Для Каждого ТекЭлемент Из МассивЗапросов Цикл
		
		// Уведомления об отгрузке
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбОтгрузке" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбОтгрузке();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбОтгрузкеОформите" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбОтгрузкеОформите();
		КонецЕсли;

		Если ТекЭлемент = "ТекстЗапросаУведомленияОбОтгрузкеОтработайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбОтгрузкеОтработайте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбОтгрузкеОжидайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбОтгрузкеОжидайте();
		КонецЕсли;
		
		// Отчеты о розничных продажах

		Если ТекЭлемент = "ТекстЗапросаОтчетыОРозничныхПродажах" Тогда
			ТекстЗапросаОтчетыОРозничныхПродажах = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаОтчетыОРозничныхПродажах(ТекстЗапросаОтчетыОРозничныхПродажах);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаОтчетыОРозничныхПродажах;
		КонецЕсли;

		Если ТекЭлемент = "ТекстЗапросаОтчетыОРозничныхПродажахОтработайте" Тогда
			ТекстЗапросаОтчетыОРозничныхПродажахОтработайте = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаОтчетыОРозничныхПродажахОтработайте(ТекстЗапросаОтчетыОРозничныхПродажахОтработайте);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаОтчетыОРозничныхПродажахОтработайте;
		КонецЕсли;

		Если ТекЭлемент = "ТекстЗапросаОтчетыОРозничныхПродажахОжидайте" Тогда
			ТекстЗапросаОтчетыОРозничныхПродажахОжидайте = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаОтчетыОРозничныхПродажахОжидайте(ТекстЗапросаОтчетыОРозничныхПродажахОжидайте);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаОтчетыОРозничныхПродажахОжидайте;
		КонецЕсли;

		// Возвраты товаров от розничных клиентов
		
		Если ТекЭлемент = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов" Тогда
			ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов(ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов;
		КонецЕсли;
			
		Если ТекЭлемент = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте" Тогда
			ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте(
				ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте;
		КонецЕсли;
			
		Если ТекЭлемент = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте" Тогда
			ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте(
				ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте;
		КонецЕсли;
		
		//ГИСМБП
		// Исключена обработка документов:
		// - МаркировкаТоваровГИСМ
		// - ПеремаркировкаТоваровГИСМ
		//Конец ГИСМБП
	
		// Уведомления о списании КиЗ
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОСписанииКиЗГИСМ" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОСписанииКиЗГИСМ.ТекстЗапросаУведомленияОСписанииКиЗГИСМ();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОформите" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОСписанииКиЗГИСМ.ТекстЗапросаУведомленияОСписанииКиЗГИСМОформите();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОтработайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОСписанииКиЗГИСМ.ТекстЗапросаУведомленияОСписанииКиЗГИСМОтработайте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОжидайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОСписанииКиЗГИСМ.ТекстЗапросаУведомленияОСписанииКиЗГИСМОжидайте();
		КонецЕсли;
		
		// Уведомления о ввозе из ЕАЭС
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОВвозеИзЕАЭС" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.ТекстЗапросаУведомленияОВвозеИзЕАЭС();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОформите" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.ТекстЗапросаУведомленияОВвозеИзЕАЭСОформите();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОтработайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.ТекстЗапросаУведомленияОВвозеИзЕАЭСОтработайте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОжидайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.ТекстЗапросаУведомленияОВвозеИзЕАЭСОжидайте();
		КонецЕсли;
		
		// Уведомления об импорте
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбИмпорте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбИмпорте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбИмпортеОформите" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбИмпортеОформите();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбИмпортеОтработайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбИмпортеОтработайте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОбИмпортеОжидайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОбИмпортеОжидайте();
		КонецЕсли;
		
		// Заявка на выпуск КиЗ 
		
		//ГИСМБП
		// Исключена обработка документов:
		// - ЗаявкаНаВыпускКиЗГИСМ
		//Конец ГИСМБП
		
		// Уведомления о поступлении
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОПоступлении" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОПоступлении();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОПоступленииОтработайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОПоступленииОтработайте();
		КонецЕсли;
		
		Если ТекЭлемент = "ТекстЗапросаУведомленияОПоступленииОжидайте" Тогда
			ТекстЗапроса = ТекстЗапроса + Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ.ТекстЗапросаУведомленияОПоступленииОжидайте();
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("Организация",   ?(ЗначениеЗаполнено(Организация),   Организация,   Неопределено));
	ПараметрыЗапроса.Вставить("Ответственный", ?(ЗначениеЗаполнено(Ответственный), Ответственный, Неопределено));
	
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТекстОформите    = НСтр("ru = 'оформите'");
	ТекстОтработайте = НСтр("ru = 'отработайте'");
	ТекстОжидайте    = НСтр("ru = 'ожидайте'");
	
	Для ТекИндекс = 0 По МассивЗапросов.Количество()-1 Цикл
		
		Выборка = РезультатЗапроса[ТекИндекс].Выбрать();
		
		// Уведомления об отгрузке
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ) Тогда
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбОтгрузке" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбОтгрузке, НСтр("ru = 'Уведомления об отгрузке'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбОтгрузкеОформите" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбОтгрузкеОформите, ТекстОформите);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбОтгрузкеОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбОтгрузкеОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбОтгрузкеОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбОтгрузкеОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОбОтгрузкеМаркированныхТоваров.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОбОтгрузкеМаркированныхТоваров.Видимость = Ложь;
			
		КонецЕсли;
		
		// Отчеты о розничных продажах
		ДоступенОтчетОРозничныхПродажах = Ложь;
		ИнтеграцияГИСМПереопределяемый.ДоступенОтчетОРозничныхПродажах(ДоступенОтчетОРозничныхПродажах);
		Если ДоступенОтчетОРозничныхПродажах Тогда
		
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаОтчетыОРозничныхПродажах" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьОтчетыОРозничныхПродажах, НСтр("ru = 'Уведомления о розничных продажах'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаОтчетыОРозничныхПродажахОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьОтчетыОРозничныхПродажахОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаОтчетыОРозничныхПродажахОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьОтчетыОРозничныхПродажахОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОРозничныхПродажах.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОРозничныхПродажах.Видимость = Ложь;
		
		КонецЕсли;
		
		// Возвраты товаров от розничных клиентов
		ДоступенВозвратТоваровОтРозничногоКлиента = Ложь;
		ИнтеграцияГИСМПереопределяемый.ДоступенВозвратТоваровОтРозничногоКлиента(ДоступенВозвратТоваровОтРозничногоКлиента);
		Если ДоступенВозвратТоваровОтРозничногоКлиента Тогда
		
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентов" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьВозвратыТоваровОтРозничныхКлиентов, НСтр("ru = 'Уведомления о розничных возвратах'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьВозвратыТоваровОтРозничныхКлиентовОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаВозвратыТоваровОтРозничныхКлиентовОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьВозвратыТоваровОтРозничныхКлиентовОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОРозничныхВозвратах.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОРозничныхВозвратах.Видимость = Ложь;
			
		КонецЕсли;
		
		
		//ГИСМБП
		// Исключена обработка документов:
		// - МаркировкаТоваровГИСМ
		// - ПеремаркировкаТоваровГИСМ
		//Конец ГИСМБП

		Элементы.ГруппаМаркировкаТоваров.Видимость = Ложь;
		
		
		Элементы.ГруппаПеремаркировкаТоваров.Видимость = Ложь;
		
		// Уведомления о списании КиЗ
		
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ) Тогда
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОСписанииКиЗГИСМ" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьСписанияКиЗМаркировки, НСтр("ru = 'Уведомления о списании КиЗ'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОформите" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьСписанияКиЗМаркировкиОформите, ТекстОформите);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьСписанияКиЗМаркировкиОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОСписанииКиЗГИСМОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьСписанияКиЗМаркировкиОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОСписанииКиЗ.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОСписанииКиЗ.Видимость = Ложь;
			
		КонецЕсли;
		
		//ГИСМБП
		// Исключена обработка документов:
		// - ЗаявкаНаВыпускКиЗ
		//Конец ГИСМБП

		Элементы.ГруппаЗаявкаНаВыпускКиЗ.Видимость = Ложь;
		
		
		// Уведомления о поступлении
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ) Тогда
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОПоступлении" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОПоступленииМаркированныхТоваров, НСтр("ru = 'Уведомления о поступлении и возврате'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОПоступленииОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОПоступленииМаркированныхТоваровОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОПоступленииОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОПоступленииМаркированныхТоваровОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОПоступленииМаркированныхТоваров.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОПоступленииМаркированныхТоваров.Видимость = Ложь;
			
		КонецЕсли;
		
		// Уведомления о ввозе из ЕАЭС
		
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ) Тогда
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОВвозеИзЕАЭС" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭС, НСтр("ru = 'Уведомления о ввозе из ЕАЭС'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОформите" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОформите, ТекстОформите);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОВвозеИзЕАЭСОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОВвозеМаркированныхТоваровИзЕАЭС.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОВвозеМаркированныхТоваровИзЕАЭС.Видимость = Ложь;
			
		КонецЕсли;
		
		// Уведомления об импорте
		
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ) Тогда
		
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбИмпорте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбИмпортеМаркированныхТоваров, НСтр("ru = 'Уведомления об импорте'"));
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбИмпортеОформите" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбИмпортеМаркированныхТоваровОформите, ТекстОформите);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбИмпортеОтработайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбИмпортеМаркированныхТоваровОтработайте, ТекстОтработайте);
			КонецЕсли;
			
			Если МассивЗапросов[ТекИндекс] = "ТекстЗапросаУведомленияОбИмпортеОжидайте" Тогда
				ВывестиПоказатель(Выборка, Элементы.ОткрытьУведомленияОбИмпортеМаркированныхТоваровОжидайте, ТекстОжидайте);
			КонецЕсли;
			
			Элементы.ГруппаУведомлениеОбИмпортеМаркированныхТоваров.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаУведомлениеОбИмпортеМаркированныхТоваров.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Отчет
	Если ПравоДоступа("Использование", Метаданные.Отчеты.ПоступленияБезДокументовГИСМ) Тогда
		Элементы.ОтчетПоступленияБезДокументовГИСМ.Видимость = Истина;
	Иначе
		Элементы.ОтчетПоступленияБезДокументовГИСМ.Видимость = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаДокументыОжидающиеОтправки();
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
		Запрос.УстановитьПараметр("Ответственный", ?(ЗначениеЗаполнено(Ответственный), Ответственный, Неопределено));
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() И Выборка.КоличествоДокументов > 0 Тогда
			ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Есть документы (%1), ожидающие отправки в ГИСМ. Выполните обмен.'"), Выборка.КоличествоДокументов);
			Элементы.НадписьДокументыОжидающиеОтправки.Заголовок   = ТекстЗаголовка;
			Элементы.ДекорацияДокументыОжидающиеОтправки.Видимость = Истина;
			Элементы.НадписьДокументыОжидающиеОтправки.Видимость   = Истина;
		Иначе
			Элементы.ДекорацияДокументыОжидающиеОтправки.Видимость = Ложь;
			Элементы.НадписьДокументыОжидающиеОтправки.Видимость   = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.ДекорацияДокументыОжидающиеОтправки.Видимость = Ложь;
		Элементы.НадписьДокументыОжидающиеОтправки.Видимость   = Ложь;
		
	КонецЕсли;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПоказатель(Выборка, Кнопка, ТекстПоказателя)
	
	КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
	Если КоличествоДокументов > 0 Тогда
		ТекстЗаголовка = ТекстПоказателя + " (" + КоличествоДокументов + ")";
		ЦветТекста = ЦветаСтиля.ЦветГиперссылкиГосИС;
	Иначе
		ТекстЗаголовка = ТекстПоказателя;
		ЦветТекста = ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС;
	КонецЕсли;
	Кнопка.Заголовок = ТекстЗаголовка;
	Кнопка.ЦветТекста = ЦветТекста;
	Кнопка.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы, 
	                                   ДальнейшееДействиеГИСМ,
	                                   ОткрытьРаспоряжения = Ложь,
	                                   ИмяПоляОтветственный = Неопределено,
	                                   ИмяПоляОрганизация = Неопределено)
	
	СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	Если ОткрытьРаспоряжения Тогда
		ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	Иначе
		СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеГИСМ", ДальнейшееДействиеГИСМ);
	КонецЕсли;
	
	Если ИмяПоляОтветственный = Неопределено Тогда
		ИмяПоляОтветственный = "Ответственный";
	КонецЕсли;
	
	Если ИмяПоляОрганизация = Неопределено Тогда
		ИмяПоляОрганизация = "Организация";
	КонецЕсли;
	
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОтветственный, Ответственный);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация, Организация);
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,,);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДокументыОжидающиеОтправки()
	
	МассивЗапросов = Новый Массив();
	ТекстЗапроса = "";
	
	//ГИСМБП
	// Исключена обработка документов:
	// - ЗаявкаНаВыпускКиЗ
	// - МаркировкаТоваровГИСМ
	// - ПеремаркировкаТоваровГИСМ
	//Конец ГИСМБП

	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ) Тогда
		
		МассивЗапросов.Добавить("
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.Документ) КАК КоличествоДокументов
		|ИЗ
		|	РегистрСведений.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ КАК СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ
		|ГДЕ
		|	(СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ДальнейшееДействие В (
		|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен),
		|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием)
		|	)
		|	И (СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ТекущееУведомлениеОбОтгрузке.Организация = &Организация
		|		ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
		|	И (СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ТекущееУведомлениеОбОтгрузке.Ответственный = &Ответственный
		|		ИЛИ &Ответственный = НЕОПРЕДЕЛЕНО))
		|
		|/////////////////////////////////////////////////////////////////////////////
		|ОБЪЕДИНИТЬ ВСЕ
		|");
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ) Тогда
		
		МассивЗапросов.Добавить("
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ.Документ) КАК КоличествоДокументов
		|ИЗ
		|	РегистрСведений.СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ КАК СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ
		|ГДЕ
		|	(СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ.ДальнейшееДействие В (
		|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен),
		|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием)
		|	)
		|	И (СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ.Документ.Организация = &Организация
		|		ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
		|	И (СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ.Документ.Ответственный = &Ответственный
		|		ИЛИ &Ответственный = НЕОПРЕДЕЛЕНО))
		|
		|/////////////////////////////////////////////////////////////////////////////
		|ОБЪЕДИНИТЬ ВСЕ
		|");
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СтатусыИнформированияГИСМ) Тогда
		
		
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ) Тогда
		
			МассивЗапросов.Добавить("
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыИнформированияГИСМ.Документ) КАК КоличествоДокументов
			|ИЗ
			|	РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
			|ГДЕ
			|	(СтатусыИнформированияГИСМ.ДальнейшееДействие В (
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен),
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием)
			|	)
			|	И СтатусыИнформированияГИСМ.ТекущееУведомление ССЫЛКА Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Организация = &Организация
			|		ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Ответственный = &Ответственный
			|		ИЛИ &Ответственный = НЕОПРЕДЕЛЕНО))
			|/////////////////////////////////////////////////////////////////////////////
			|ОБЪЕДИНИТЬ ВСЕ
			|");
			
		КонецЕсли;

		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ) Тогда
		
			МассивЗапросов.Добавить("
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыИнформированияГИСМ.Документ) КАК КоличествоДокументов
			|ИЗ
			|	РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
			|ГДЕ
			|	(СтатусыИнформированияГИСМ.ДальнейшееДействие В (
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен),
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием)
			|	)
			|	И СтатусыИнформированияГИСМ.ТекущееУведомление ССЫЛКА Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Организация = &Организация
			|		ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Ответственный = &Ответственный
			|		ИЛИ &Ответственный = НЕОПРЕДЕЛЕНО))
			|/////////////////////////////////////////////////////////////////////////////
			|ОБЪЕДИНИТЬ ВСЕ
			|");
			
		КонецЕсли;
		
		Если ПравоДоступа("Чтение", Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ) Тогда
		
			МассивЗапросов.Добавить("
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыИнформированияГИСМ.Документ) КАК КоличествоДокументов
			|ИЗ
			|	РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
			|ГДЕ
			|	(СтатусыИнформированияГИСМ.ДальнейшееДействие В (
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен),
			|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием)
			|	)
			|	И СтатусыИнформированияГИСМ.ТекущееУведомление ССЫЛКА Документ.УведомлениеОСписанииКиЗГИСМ
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Организация = &Организация
			|		ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|	И (СтатусыИнформированияГИСМ.ТекущееУведомление.Ответственный = &Ответственный
			|		ИЛИ &Ответственный = НЕОПРЕДЕЛЕНО))
			|/////////////////////////////////////////////////////////////////////////////
			|ОБЪЕДИНИТЬ ВСЕ
			|");
			
		КонецЕсли;
		
		ДоступенОтчетОРозничныхПродажах = Ложь;
		ИнтеграцияГИСМПереопределяемый.ДоступенОтчетОРозничныхПродажах(ДоступенОтчетОРозничныхПродажах);
		Если ДоступенОтчетОРозничныхПродажах Тогда
			ТекстЗапросаКоличествоОтчетовОРозничныхПродажахОжидающиеОтправки = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаКоличествоОтчетовОРозничныхПродажахОжидающиеОтправки(
				ТекстЗапросаКоличествоОтчетовОРозничныхПродажахОжидающиеОтправки);
			ТекстЗапросаВрем = ТекстЗапросаКоличествоОтчетовОРозничныхПродажахОжидающиеОтправки;
			Если ЗначениеЗаполнено(ТекстЗапросаВрем) Тогда
				МассивЗапросов.Добавить(ТекстЗапросаВрем);
			КонецЕсли;
		КонецЕсли;
		
		ДоступенВозвратТоваровОтРозничногоКлиента = Ложь;
		ИнтеграцияГИСМПереопределяемый.ДоступенВозвратТоваровОтРозничногоКлиента(ДоступенВозвратТоваровОтРозничногоКлиента);
		Если ДоступенВозвратТоваровОтРозничногоКлиента Тогда
			ТекстЗапросаКоличествоВозвратовОтРозничныхКлиентовОжидающиеОтправки = "";
			ИнтеграцияГИСМПереопределяемый.ТекстЗапросаКоличествоВозвратовОтРозничныхКлиентовОжидающиеОтправки(
				ТекстЗапросаКоличествоВозвратовОтРозничныхКлиентовОжидающиеОтправки);
			ТекстЗапросаВрем = ТекстЗапросаКоличествоВозвратовОтРозничныхКлиентовОжидающиеОтправки;
			Если ЗначениеЗаполнено(ТекстЗапросаВрем) Тогда
				МассивЗапросов.Добавить(ТекстЗапросаВрем);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Индекс = 0;
	Для Индекс = 0 По МассивЗапросов.Количество()-1 Цикл
		Если Индекс = 0 Тогда
			МассивЗапросов[Индекс] = СтрЗаменить(МассивЗапросов[Индекс], "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
			МассивЗапросов[Индекс] = СтрЗаменить(МассивЗапросов[Индекс], "ИЗ", "ПОМЕСТИТЬ ВсеДокументы ИЗ");
		КонецЕсли;
		Если Индекс = МассивЗапросов.Количество()-1 Тогда
			МассивЗапросов[Индекс] = СтрЗаменить(МассивЗапросов[Индекс], "ОБЪЕДИНИТЬ ВСЕ", "");
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + МассивЗапросов[Индекс];
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|;
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВсеДокументы.КоличествоДокументов),0) КАК КоличествоДокументов
		|ИЗ
		|	ВсеДокументы
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Уведомления об отгрузке

&НаКлиенте
Процедура ОткрытьУведомленияОбОтгрузке(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОбОтгрузкеОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьУведомленияОбОтгрузкеОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОбОтгрузкеОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

// Отчеты о розничных продажах

&НаКлиенте
Процедура ОткрытьОтчетыОРозничныхПродажах(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаОтчетыОРозничныхПродажах(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеДействияИлиОжидания");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетыОРозничныхПродажахОтработайте(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаОтчетыОРозничныхПродажах(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеДействия");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетыОРозничныхПродажахОжидайте(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаОтчетыОРозничныхПродажах(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеОжидания");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);
	
КонецПроцедуры

// Возвраты от розничных клиентов

&НаКлиенте
Процедура ОткрытьВозвратыТоваровОтРозничныхКлиентов(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаВозвратыТоваровОтРозничныхКлиентов(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеДействияИлиОжидания");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратыТоваровОтРозничныхКлиентовОтработайте(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаВозвратыТоваровОтРозничныхКлиентов(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеДействия");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратыТоваровОтРозничныхКлиентовОжидайте(Команда)
	
	ПараметрыФормы = Неопределено;
	ИнтеграцияГИСМКлиентПереопределяемый.ПараметрыОткрытияСпискаВозвратыТоваровОтРозничныхКлиентов(ПараметрыФормы);
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДальнейшееДействиеГИСМ", "ВсеТребующиеОжидания");
	ОткрытьФормуСпискаДокументов(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ДальнейшееДействиеГИСМ,
		ПараметрыФормы.ОткрытьРаспоряжения,
		ПараметрыФормы.ИмяПоляОтветственный,
		ПараметрыФормы.ИмяПоляОрганизация);
	
КонецПроцедуры

// Списания КиЗ маркировки

&НаКлиенте
Процедура ОткрытьСписанияКиЗМаркировки(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОСписанииКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписанияКиЗМаркировкиОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОСписанииКиЗГИСМ.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписанияКиЗМаркировкиОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОСписанииКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписанияКиЗМаркировкиОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОСписанииКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

// Маркировка товаров

&НаКлиенте
Процедура ОткрытьМаркировкуТоваров(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаркировкуТоваровОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаркировкуТоваровОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

// Перемаркировка товаров

&НаКлиенте
Процедура ОткрытьПеремаркировкуТоваров(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПеремаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремаркировкуТоваровОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПеремаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремаркировкуТоваровОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПеремаркировкаТоваровГИСМ.Форма.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры
	
// Заявки на выпуск КиЗ

&НаКлиенте
Процедура ОткрытьЗаявкиНаВыпускКиЗДляМаркировки(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗаявкаНаВыпускКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявкиНаВыпускКиЗДляМаркировкиОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗаявкаНаВыпускКиЗГИСМ.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьЗаявкиНаВыпускКиЗДляМаркировкиОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗаявкаНаВыпускКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявкиНаВыпускКиЗДляМаркировкиОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗаявкаНаВыпускКиЗГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры
	
// Уведомление о поступлении маркированных товаров

&НаКлиенте
Процедура ОткрытьУведомленияОПоступленииМаркированныхТоваров(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПоступленииМаркированныхТоваровОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПоступленииМаркированныхТоваровОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

// Уведомление о ввозе маркированных товаров из ЕАЭС

&НаКлиенте
Процедура ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОВвозеМаркированныхТоваровИзЕАЭСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

// Уведомление об импорте маркированных товаров

&НаКлиенте
Процедура ОткрытьУведомленияОбИмпортеМаркированныхТоваров(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОбИмпортеМаркированныхТоваровОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОбИмпортеМаркированныхТоваровОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОбИмпортеМаркированныхТоваровОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоступленияБезДокументовГИСМ(Команда)
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
	КонецЕсли;
	ОткрытьФорму("Отчет.ПоступленияБезДокументовГИСМ.Форма.ФормаОтчета", ПараметрыФормы ,Истина);
	
КонецПроцедуры

#КонецОбласти
